# Catering Services Database

## Team Members Names - Group 12
1.	Naga Moulika Vema
2.	Moulya Reddygari Bhupal
3.	Venkata Naga Triveni Bottu
4.	Tejaswi Gummadi
5.	Sushmitha Gangadari

In [15]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.10/dist-packages (9.1.0)

In [16]:
import mysql.connector
from mysql.connector import Error

In [17]:
!apt-get update
!apt-get install -y mysql-server

Hit:1 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu2204/x86_64  InRelease
Hit:2 http://security.ubuntu.com/ubuntu jammy-security InRelease
Hit:3 http://archive.ubuntu.com/ubuntu jammy InRelease
Hit:4 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease
Hit:5 http://archive.ubuntu.com/ubuntu jammy-updates InRelease
Hit:6 http://archive.ubuntu.com/ubuntu jammy-backports InRelease
Hit:7 https://r2u.stat.illinois.edu/ubuntu jammy InRelease
Hit:8 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease
Hit:9 https://ppa.launchpadcontent.net/graphics-drivers/ppa/ubuntu jammy InRelease
Hit:10 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease
Reading package lists... Done
W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
mysql-server is already the newest version (8.0.40-0ubuntu0.22.04.1).
0 upgraded, 0 newly installed, 0 to remove and 59 not upgraded.

In [18]:
!service mysql start

 * Starting MySQL database server mysqld
   ...done.

In [19]:
!mysql -e "ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY '#Group12';"

ERROR 1045 (28000): Access denied for user 'root'@'localhost' (using password: NO)

In [20]:
db_connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="#Group12"
)

In [21]:
# Delete the database if already present
# Connect to MySQL server
db_connection = mysql.connector.connect(
    host="localhost",
    user="root",  # Replace with your MySQL username
    password="#Group12"  # Replace with your MySQL password
)
cursor = db_connection.cursor()

# Drop the database if it already exist to start with clean database creation
database_name = "CateringServices"
cursor.execute(f"DROP DATABASE IF EXISTS {database_name}")
print(f"Database '{database_name}' has been deleted.")

# Close the connection
cursor.close()
db_connection.close()

Database 'CateringServices' has been deleted.

# Connect to sql server

In [22]:
# Connect to MySQL server
db_connection = mysql.connector.connect(
    host='localhost',
    user='root',
    password='#Group12'
)
cursor = db_connection.cursor()

# Create the database
database_name = "CateringServices"
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {database_name}")
cursor.execute(f"USE {database_name}")

## Code to create Role table

In [23]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_role_Table = """
    CREATE TABLE IF NOT EXISTS Role (
        roleID INT AUTO_INCREMENT PRIMARY KEY,
        roleName VARCHAR(45) NOT NULL UNIQUE,
        canAssignEvents BOOLEAN NOT NULL,
        canDistributeCoupons BOOLEAN NOT NULL,
        canViewSalaries BOOLEAN NOT NULL,
        canManageInventory BOOLEAN NOT NULL,
        canScheduleEvents BOOLEAN NOT NULL
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_role_Table)
    # Commit the transaction
    db_connection.commit()
    print("Role Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Role Table created successfully!

## Code to create Employee table

In [24]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_employee_Table = """
    CREATE TABLE IF NOT EXISTS Employee (
        employeeID INT AUTO_INCREMENT PRIMARY KEY,
        firstName VARCHAR(45) NOT NULL,
        middleName VARCHAR(45),
        lastName VARCHAR(45) NOT NULL,
        phoneNum VARCHAR(15) NOT NULL UNIQUE,
        emailID VARCHAR(50) NOT NULL,
        aptNum VARCHAR(15),
        streetName VARCHAR(45),
        city VARCHAR(30),
        state VARCHAR(30),
        pincode INT,
        gender VARCHAR(10),
        employmentType VARCHAR(30),
        roleID INT NOT NULL,
        FOREIGN KEY (roleID) REFERENCES Role(roleID)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_employee_Table)
    # Commit the transaction
    db_connection.commit()
    print("Employee Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Employee Table created successfully!

## Code to create Location table

In [25]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_location_Table = """
    CREATE TABLE IF NOT EXISTS Location (
        locationID INT AUTO_INCREMENT PRIMARY KEY,
        locationName VARCHAR(45) NOT NULL,
        streetName VARCHAR(45),
        city VARCHAR(30),
        state VARCHAR(30),
        pincode INT,
        capacity INT NOT NULL,
        isAvailable VARCHAR(10),
        availabilityNotes VARCHAR(100),
        dailyEventLimit INT,
        lastUpdated DATETIME,
        locationType VARCHAR(50)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_location_Table)
    # Commit the transaction
    db_connection.commit()
    print("Location Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Location Table created successfully!

## Code to create Events table

In [26]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_events_Table = """
    CREATE TABLE IF NOT EXISTS Events (
        eventID INT AUTO_INCREMENT PRIMARY KEY,
        eventName VARCHAR(100) NOT NULL,
        locationID INT NOT NULL,
        eventTime DATETIME NOT NULL,
        eventHours INT NOT NULL,
        handledByManagerID INT,
        supervisorID INT,
        approved VARCHAR(10) ,
        FOREIGN KEY (locationID) REFERENCES Location(locationID),
        FOREIGN KEY (handledByManagerID) REFERENCES Employee(employeeID),
        FOREIGN KEY (supervisorID) REFERENCES Employee(employeeID)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_events_Table)
    # Commit the transaction
    db_connection.commit()
    print("Events Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Events Table created successfully!

## Code to create Coupons table

In [27]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_coupons_Table = """
    CREATE TABLE IF NOT EXISTS Coupons (
        couponID INT AUTO_INCREMENT PRIMARY KEY,
        employeeID INT NOT NULL,
        couponValue INT NOT NULL,
        redemptionStatus VARCHAR(15),
        allocatedByEmployeeID INT,
        FOREIGN KEY (employeeID) REFERENCES Employee(employeeID),
        FOREIGN KEY (allocatedByEmployeeID) REFERENCES Employee(employeeID)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_coupons_Table)
    # Commit the transaction
    db_connection.commit()
    print("Coupons Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Coupons Table created successfully!

## Code to create Salaries table

In [28]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create the Salaries table
create_salaries_Table = """
    CREATE TABLE IF NOT EXISTS Salaries (
        salaryID INT AUTO_INCREMENT PRIMARY KEY,  -- Unique identifier for salary records
        employeeID INT NOT NULL,                  -- Foreign key referencing Employee table
        salaryAmount INT,
        hoursWorked INT,
        hourlyPay INT,
        fixedPay INT,
        monthYear VARCHAR(7),                     -- Tracks salary period (e.g., '2024-11')
        UNIQUE (employeeID, monthYear),           -- Ensures each employee gets one salary entry per month
        FOREIGN KEY (employeeID) REFERENCES Employee(employeeID)
    )
"""

try:
    # Execute the create table query
    cursor.execute(create_salaries_Table)
    # Commit the transaction
    db_connection.commit()
    print("Salaries Table created successfully with unique employeeID and monthYear constraint!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Salaries Table created successfully with unique employeeID and monthYear constraint!

## Code to create Vendor table

In [29]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_vendor_table = """
    CREATE TABLE IF NOT EXISTS Vendor (
        vendorID INT AUTO_INCREMENT PRIMARY KEY,
        firstName VARCHAR(45),
        middleName VARCHAR(45),
        lastName VARCHAR(45),
        phoneNum VARCHAR(15),
        emailID VARCHAR(50),
        aptNum VARCHAR(15),
        streetName VARCHAR(45),
        city VARCHAR(30),
        state VARCHAR(50),
        pincode INT,
        category VARCHAR(50)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_vendor_table)
    # Commit the transaction
    db_connection.commit()
    print("Vendor Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Vendor Table created successfully!

## Code to create Inventory table

In [30]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_inventory_table = """
    CREATE TABLE IF NOT EXISTS Inventory (
        inventoryID INT AUTO_INCREMENT PRIMARY KEY,
        itemName VARCHAR(100) NOT NULL,
        itemCategory VARCHAR(50),
        quantity INT NOT NULL,
        vendorID INT NOT NULL,
        eventID INT,
        FOREIGN KEY (vendorID) REFERENCES Vendor(vendorID),
        FOREIGN KEY (eventID) REFERENCES Events(eventID)
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_inventory_table)
    # Commit the transaction
    db_connection.commit()
    print("Inventory Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Inventory Table created successfully!

## Code to create EmployeeEventAssignments table

In [31]:
# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# SQL Statement to create table
create_EmployeeEventAssignments_table = """
    CREATE TABLE IF NOT EXISTS EmployeeEventAssignments (
        assignmentID INT AUTO_INCREMENT PRIMARY KEY,
        employeeID INT NOT NULL,
        eventID INT NOT NULL,
        taskDescription VARCHAR(100),
        FOREIGN KEY (employeeID) REFERENCES Employee(employeeID),
        FOREIGN KEY (eventID) REFERENCES Events(eventID),
        UNIQUE (employeeID, eventID) -- Ensures unique combinations
    )
    """

try:
    # Execute the insert query
    cursor.execute(create_EmployeeEventAssignments_table)
    # Commit the transaction
    db_connection.commit()
    print("Employee Event Assignments Table created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Employee Event Assignments Table created successfully!

## Insert sample records into the Role table

In [32]:
# Define database name
database_name = "CateringServices"

# Use the database
try:
    cursor.execute(f"USE {database_name}")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    exit(1)

# Insert sample records into the Role table
insert_query_roleTable = """
    INSERT INTO Role (roleName, canAssignEvents, canDistributeCoupons, canViewSalaries, canManageInventory, canScheduleEvents)
    VALUES
    ('Manager', TRUE, TRUE, TRUE, TRUE, TRUE),
    ('Supervisor', FALSE, TRUE, FALSE, TRUE, TRUE),
    ('Non-Supervisor', FALSE, FALSE, FALSE, FALSE, FALSE),
    ('PartTime-Employee', FALSE, FALSE, FALSE, FALSE, FALSE)
"""

try:
    # Execute the insert query
    cursor.execute(insert_query_roleTable)
    # Commit the transaction
    db_connection.commit()
    print("Sample records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample records created successfully!

## Insert sample records into the Employee table

In [33]:
# Insert sample records into the Employee table
insert_query_employeeTable = """
    INSERT INTO Employee (employeeID, firstName, middleName, lastName, phoneNum, emailID, aptNum, streetName, city, state, pincode, gender, employmentType, roleID)
    VALUES
    (1, 'John', 'M', 'Doe', '1234567890', 'john.doe@example.com', '1A', 'Main Street', 'Denton', 'Texas', 76201, 'Male', 'Full-Time', 1),
    (2, 'Jane', 'A', 'Smith', '1234567891', 'jane.smith@example.com', '2B', 'Elm Street', 'Frisco', 'Texas', 75033, 'Female', 'Part-Time', 4),
    (3, 'Robert', 'B', 'Johnson', '1234567892', 'robert.johnson@example.com', '3C', 'Pine Street', 'Aubrey', 'Texas', 76227, 'Male', 'Full-Time', 2),
    (4, 'Alice', NULL, 'Brown', '1234567893', 'alice.brown@example.com', NULL, 'Oak Street', 'Plano', 'Texas', 75023, 'Female', 'Full-Time', 3),
    (5, 'Michael', NULL, 'Davis', '1234567894', 'michael.davis@example.com', '5D', 'Maple Street', 'Dallas', 'Texas', 75201, 'Male', 'Part-Time', 4),
    (6, 'Emily', 'J', 'Clark', '1234567895', 'emily.clark@example.com', '6E', 'Cedar Street', 'Denton', 'Texas', 76202, 'Female', 'Full-Time', 1),
    (7, 'Chris', 'L', 'Evans', '1234567896', 'chris.evans@example.com', NULL, 'Birch Street', 'Frisco', 'Texas', 75034, 'Male', 'Full-Time', 2),
    (8, 'Sarah', NULL, 'Wilson', '1234567897', 'sarah.wilson@example.com', '8F', 'Ash Street', 'Aubrey', 'Texas', 76228, 'Female', 'Part-Time', 4),
    (9, 'David', 'A', 'Taylor', '1234567898', 'david.taylor@example.com', '9G', 'Spruce Street', 'Plano', 'Texas', 75024, 'Male', 'Full-Time', 3),
    (10, 'Laura', 'K', 'Martinez', '1234567899', 'laura.martinez@example.com', NULL, 'Willow Street', 'Dallas', 'Texas', 75202, 'Female', 'Full-Time', 1),
    (11, 'Daniel', 'P', 'Garcia', '12345678910', 'daniel.garcia@example.com', '10H', 'Oak Drive', 'Denton', 'Texas', 76203, 'Male', 'Part-Time', 4),
    (12, 'Sophia', NULL, 'Miller', '12345678911', 'sophia.miller@example.com', '11I', 'Cypress Lane', 'Frisco', 'Texas', 75035, 'Female', 'Part-Time', 4),
    (13, 'Ethan', 'Q', 'Rodriguez', '12345678912', 'ethan.rodriguez@example.com', '12J', 'Hickory Road', 'Aubrey', 'Texas', 76229, 'Male', 'Full-Time', 3),
    (14, 'Olivia', 'R', 'Martinez', '12345678913', 'olivia.martinez@example.com', '13K', 'Aspen Way', 'Plano', 'Texas', 75025, 'Female', 'Part-Time', 4),
    (15, 'Benjamin', NULL, 'Lee', '12345678914', 'benjamin.lee@example.com', NULL, 'Sequoia Blvd', 'Dallas', 'Texas', 75203, 'Male', 'Part-Time', 4),
    (16, 'Emma', 'S', 'Perez', '12345678915', 'emma.perez@example.com', '14L', 'Magnolia Street', 'Denton', 'Texas', 76204, 'Female', 'Full-Time', 2),
    (17, 'Noah', NULL, 'Moore', '12345678916', 'noah.moore@example.com', '15M', 'Cedar Grove', 'Frisco', 'Texas', 75036, 'Male', 'Full-Time', 3),
    (18, 'Isabella', 'T', 'Flores', '12345678917', 'isabella.flores@example.com', '16N', 'Elm Grove', 'Aubrey', 'Texas', 76230, 'Female', 'Full-Time', 1),
    (19, 'James', NULL, 'Anderson', '12345678918', 'james.anderson@example.com', '17O', 'Birch Trail', 'Plano', 'Texas', 75026, 'Male', 'Part-Time', 4),
    (20, 'Charlotte', 'U', 'Lopez', '12345678919', 'charlotte.lopez@example.com', NULL, 'Palm Way', 'Dallas', 'Texas', 75204, 'Female', 'Full-Time', 2),
    (21, 'Alexander', NULL, 'King', '12345678920', 'alexander.king@example.com', '18P', 'Maple Trail', 'Denton', 'Texas', 76205, 'Male', 'Part-Time', 4),
    (22, 'Amelia', 'V', 'Scott', '12345678921', 'amelia.scott@example.com', '19Q', 'Hickory Lane', 'Frisco', 'Texas', 75037, 'Female', 'Part-Time', 4),
    (23, 'Mason', NULL, 'Torres', '12345678922', 'mason.torres@example.com', NULL, 'Spruce Drive', 'Aubrey', 'Texas', 76231, 'Male', 'Full-Time', 1),
    (24, 'Harper', 'W', 'Nguyen', '12345678923', 'harper.nguyen@example.com', '20R', 'Cypress Trail', 'Plano', 'Texas', 75027, 'Female', 'Part-Time', 4),
    (25, 'Elijah', 'X', 'Garcia', '12345678924', 'elijah.garcia@example.com', '21S', 'Sequoia Blvd', 'Dallas', 'Texas', 75205, 'Male', 'Part-Time', 4),
    (26, 'Abigail', 'Y', 'Brown', '12345678925', 'abigail.brown@example.com', '22T', 'Aspen Avenue', 'Denton', 'Texas', 76206, 'Female', 'Full-Time', 1),
    (27, 'Henry', NULL, 'Clark', '12345678926', 'henry.clark@example.com', NULL, 'Maple Road', 'Frisco', 'Texas', 75038, 'Male', 'Part-Time', 4),
    (28, 'Sofia', 'Z', 'Lopez', '12345678927', 'sofia.lopez@example.com', '23U', 'Oakwood Drive', 'Aubrey', 'Texas', 76232, 'Female', 'Full-Time', 2),
    (29, 'William', NULL, 'Jones', '12345678928', 'william.jones@example.com', '24V', 'Pine Circle', 'Plano', 'Texas', 75028, 'Male', 'Part-Time', 4),
    (30, 'Mia', 'A', 'Scott', '12345678929', 'mia.scott@example.com', '25W', 'Cypress Avenue', 'Dallas', 'Texas', 75206, 'Female', 'Full-Time', 3)
"""
try:
    cursor.execute(insert_query_employeeTable)
    db_connection.commit()
    print("Sample Employee records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Employee records created successfully!

## Insert sample records into the Location table

In [34]:
# Insert sample records into the Location table
insert_query_locationTable = """
    INSERT INTO Location (locationName, streetName, city, state, pincode, capacity, isAvailable, availabilityNotes, dailyEventLimit, lastUpdated, locationType)
    VALUES
    ('Main Hall', 'First Ave', 'Denton', 'Texas', 76201, 500, 'Yes', 'Available for all events', 3, NOW(), 'Indoor'),
    ('Conference Room', 'Second Ave', 'Denton', 'Texas', 76202, 200, 'Yes', 'Equipped with projectors', 2, NOW(), 'Indoor'),
    ('Outdoor Park', 'Park Lane', 'Denton', 'Texas', 76203, 1000, 'No', 'Under Maintenance', 5, NOW(), 'Outdoor'),
    ('Banquet Hall', 'Third Ave', 'Frisco', 'Texas', 75033, 300, 'Yes', 'Ideal for weddings', 4, NOW(), 'Indoor'),
    ('Sports Ground', 'Fourth Ave', 'Frisco', 'Texas', 75034, 1500, 'Yes', 'Available for sports events', 5, NOW(), 'Outdoor'),
    ('Community Center', 'Fifth Ave', 'Frisco', 'Texas', 75035, 400, 'Yes', 'Used for meetings', 3, NOW(), 'Indoor'),
    ('Town Hall', 'Sixth Ave', 'Aubrey', 'Texas', 76227, 800, 'Yes', 'Open for public events', 3, NOW(), 'Indoor'),
    ('Open Air Stage', 'Seventh Ave', 'Aubrey', 'Texas', 76228, 1200, 'Yes', 'Available for concerts', 4, NOW(), 'Outdoor'),
    ('Gallery', 'Eighth Ave', 'Aubrey', 'Texas', 76229, 200, 'Yes', 'For exhibitions', 2, NOW(), 'Indoor'),
    ('Training Center', 'Ninth Ave', 'Plano', 'Texas', 75023, 250, 'Yes', 'For training sessions', 2, NOW(), 'Indoor'),
    ('Exhibition Hall', 'Tenth Ave', 'Plano', 'Texas', 75024, 600, 'No', 'Reserved for expo', 3, NOW(), 'Indoor'),
    ('Sports Complex', 'Eleventh Ave', 'Plano', 'Texas', 75025, 2000, 'Yes', 'Available for sports events', 6, NOW(), 'Outdoor'),
    ('Convention Center', 'Twelfth Ave', 'Dallas', 'Texas', 75201, 1500, 'Yes', 'For conventions', 5, NOW(), 'Indoor'),
    ('Lecture Hall', 'Thirteenth Ave', 'Dallas', 'Texas', 75202, 250, 'Yes', 'Used for seminars', 2, NOW(), 'Indoor'),
    ('Stadium', 'Fourteenth Ave', 'Dallas', 'Texas', 75203, 3000, 'Yes', 'Open for large events', 6, NOW(), 'Outdoor'),
    ('Amphitheater', 'Fifteenth Ave', 'Denton', 'Texas', 76204, 800, 'Yes', 'Ideal for plays', 3, NOW(), 'Outdoor'),
    ('Library Hall', 'Sixteenth Ave', 'Denton', 'Texas', 76205, 150, 'Yes', 'Available for meetings', 2, NOW(), 'Indoor'),
    ('Science Center', 'Seventeenth Ave', 'Frisco', 'Texas', 75036, 600, 'No', 'Under Renovation', 3, NOW(), 'Indoor'),
    ('Music Hall', 'Eighteenth Ave', 'Frisco', 'Texas', 75037, 400, 'Yes', 'For music recitals', 3, NOW(), 'Indoor'),
    ('Green Park', 'Nineteenth Ave', 'Aubrey', 'Texas', 76230, 1000, 'Yes', 'Available for public events', 5, NOW(), 'Outdoor'),
    ('Auditorium', 'Twentieth Ave', 'Aubrey', 'Texas', 76231, 700, 'Yes', 'Ideal for conferences', 3, NOW(), 'Indoor'),
    ('Cinema Hall', 'Twenty-First Ave', 'Plano', 'Texas', 75026, 300, 'Yes', 'Available for film events', 2, NOW(), 'Indoor'),
    ('Playground', 'Twenty-Second Ave', 'Plano', 'Texas', 75027, 1200, 'Yes', 'Open for recreational events', 5, NOW(), 'Outdoor'),
    ('Sports Pavilion', 'Twenty-Third Ave', 'Dallas', 'Texas', 75204, 800, 'Yes', 'For sports and games', 4, NOW(), 'Outdoor'),
    ('Art Gallery', 'Twenty-Fourth Ave', 'Dallas', 'Texas', 75205, 300, 'Yes', 'For art exhibitions', 2, NOW(), 'Indoor'),
    ('Tech Center', 'Twenty-Fifth Ave', 'Denton', 'Texas', 76206, 600, 'Yes', 'For tech expos', 3, NOW(), 'Indoor'),
    ('Community Hall', 'Twenty-Sixth Ave', 'Frisco', 'Texas', 75038, 200, 'Yes', 'For community events', 2, NOW(), 'Indoor'),
    ('Riverfront Stage', 'Twenty-Seventh Ave', 'Aubrey', 'Texas', 76232, 900, 'Yes', 'For open-air performances', 4, NOW(), 'Outdoor'),
    ('Boardroom', 'Twenty-Eighth Ave', 'Plano', 'Texas', 75028, 100, 'Yes', 'For corporate meetings', 2, NOW(), 'Indoor'),
    ('Outdoor Arena', 'Twenty-Ninth Ave', 'Dallas', 'Texas', 75206, 2500, 'No', 'Reserved for private events', 5, NOW(), 'Outdoor')
"""

try:
    cursor.execute(insert_query_locationTable)
    db_connection.commit()
    print("Sample Location records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Location records created successfully!

## Insert sample records into the Events table

In [35]:
# Insert sample records into the Events table
insert_query_eventsTable = """
    INSERT INTO Events (eventName, locationID, eventTime, eventHours, handledByManagerID, supervisorID, approved)
    VALUES
    ('Annual Gala', 1, '2024-07-01 18:00:00', 4, 1, 2, 'Yes'),
    ('Tech Conference', 2, '2024-07-05 09:00:00', 6, 1, 3, 'Yes'),
    ('Music Festival', 3, '2024-07-10 16:00:00', 8, 2, 4, 'No'),
    ('Wedding Reception', 4, '2024-07-15 19:00:00', 5, 3, 5, 'Yes'),
    ('Sports Meet', 5, '2024-07-20 08:00:00', 7, 1, 2, 'Yes'),
    ('Food Expo', 6, '2024-08-01 12:00:00', 3, 2, 3, 'Yes'),
    ('Charity Ball', 7, '2024-08-05 19:30:00', 4, 1, 4, 'Yes'),
    ('Corporate Meetup', 8, '2024-08-10 10:00:00', 6, 2, 5, 'Yes'),
    ('Art Exhibition', 9, '2024-08-15 14:00:00', 2, 3, 2, 'Yes'),
    ('Product Launch', 10, '2024-08-20 11:00:00', 7, 1, 3, 'Yes'),
    ('Town Hall Meeting', 11, '2024-08-25 17:00:00', 3, 2, 4, 'No'),
    ('Music Recital', 12, '2024-09-01 15:00:00', 8, 3, 5, 'Yes'),
    ('Book Fair', 13, '2024-09-05 09:00:00', 6, 1, 2, 'Yes'),
    ('Film Screening', 14, '2024-09-10 20:00:00', 5, 2, 3, 'Yes'),
    ('Training Workshop', 15, '2024-09-15 10:00:00', 4, 3, 4, 'Yes'),
    ('Open Mic Night', 16, '2024-09-20 19:00:00', 3, 1, 5, 'No'),
    ('Hackathon', 17, '2024-09-25 08:00:00', 7, 2, 2, 'Yes'),
    ('Startup Showcase', 18, '2024-10-01 11:30:00', 8, 3, 3, 'Yes'),
    ('Science Fair', 19, '2024-10-05 10:00:00', 5, 1, 4, 'Yes'),
    ('Cultural Fest', 20, '2024-10-10 17:00:00', 6, 2, 5, 'Yes'),
    ('Sports Day', 21, '2024-10-15 09:00:00', 3, 3, 2, 'Yes'),
    ('Networking Event', 22, '2024-10-20 13:00:00', 2, 1, 3, 'No'),
    ('Team Building Retreat', 23, '2024-10-25 09:00:00', 4, 2, 4, 'Yes'),
    ('Fundraiser', 24, '2024-11-01 18:00:00', 7, 3, 5, 'Yes'),
    ('Gaming Tournament', 25, '2024-11-05 10:00:00', 8, 1, 2, 'Yes'),
    ('Halloween Party', 26, '2024-11-10 19:00:00', 6, 2, 3, 'Yes'),
    ('Business Conference', 27, '2024-11-15 11:00:00', 4, 3, 4, 'Yes'),
    ('Holiday Market', 28, '2024-11-20 15:00:00', 5, 1, 5, 'No'),
    ('Cooking Contest', 29, '2024-11-25 10:00:00', 3, 2, 2, 'Yes'),
    ('Thanksgiving Feast', 30, '2024-11-30 18:30:00', 6, 3, 3, 'Yes'),
    ('Annual Conference', 1, '2024-12-01 08:00:00', 8, 1, 4, 'Yes'),
    ('Winter Concert', 2, '2024-12-05 19:00:00', 5, 2, 5, 'Yes'),
    ('Company Dinner', 3, '2024-12-10 18:00:00', 3, 3, 2, 'Yes'),
    ('Winter Carnival', 4, '2024-12-15 10:00:00', 4, 1, 3, 'Yes'),
    ('Christmas Party', 5, '2024-12-20 20:00:00', 6, 2, 4, 'Yes'),
    ('New Year Bash', 6, '2024-12-25 23:00:00', 8, 3, 5, 'Yes'),
    ('Dance Festival', 7, '2024-07-15 18:30:00', 4, 1, 2, 'Yes'),
    ('Poetry Slam', 8, '2024-08-20 15:30:00', 5, 2, 3, 'Yes'),
    ('Volunteer Meetup', 9, '2024-09-12 09:30:00', 3, 3, 4, 'No'),
    ('Marketing Expo', 10, '2024-10-08 14:00:00', 7, 1, 5, 'Yes'),
    ('Literature Fest', 11, '2024-11-02 12:00:00', 6, 2, 2, 'Yes'),
    ('Robotics Fair', 12, '2024-12-11 13:00:00', 8, 3, 3, 'Yes'),
    ('Debate Tournament', 13, '2024-11-30 16:30:00', 4, 1, 4, 'Yes'),
    ('Music Jam', 14, '2024-08-05 19:30:00', 3, 2, 5, 'Yes'),
    ('Health Seminar', 15, '2024-07-22 10:00:00', 6, 3, 2, 'Yes'),
    ('Tech Meetup', 16, '2024-09-18 14:00:00', 5, 1, 3, 'Yes'),
    ('Environmental Summit', 17, '2024-10-22 10:00:00', 4, 2, 4, 'No'),
    ('Employee Appreciation Night', 18, '2024-11-28 19:00:00', 7, 3, 5, 'Yes'),
    ('Culinary Show', 19, '2024-12-12 18:30:00', 8, 1, 2, 'Yes'),
    ('Research Symposium', 20, '2024-12-14 09:00:00', 6, 2, 3, 'Yes')
"""

try:
    cursor.execute(insert_query_eventsTable)
    db_connection.commit()
    print("Sample Events records created successfully with event hours!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Events records created successfully with event hours!

## Insert sample records into the Coupons table

In [36]:
# Insert sample records into the Coupons table

#Part-Time Employee IDs: [2, 5, 8, 11, 12, 14, 15, 19, 21, 22, 24, 25, 27, 29]
insert_query_couponsTable = """
    INSERT INTO Coupons (employeeID, couponValue, redemptionStatus, allocatedByEmployeeID)
    VALUES
    (2, 5, 'Unredeemed', 1),
    (5, 9, 'Redeemed', 2),
    (8, 5, 'Unredeemed', 3),
    (12, 9, 'Redeemed', 4),
    (15, 5, 'Unredeemed', 5),
    (19, 9, 'Redeemed', 1),
    (21, 5, 'Unredeemed', 2),
    (22, 9, 'Redeemed', 3),
    (25, 5, 'Unredeemed', 4),
    (27, 9, 'Redeemed', 5),
    (11, 5, 'Unredeemed', 1),
    (8, 9, 'Redeemed', 2),
    (12, 5, 'Unredeemed', 3),
    (15, 9, 'Redeemed', 4),
    (19, 5, 'Unredeemed', 5),
    (21, 9, 'Redeemed', 1),
    (22, 5, 'Unredeemed', 2),
    (25, 9, 'Redeemed', 3),
    (29, 5, 'Unredeemed', 4),
    (21, 9, 'Redeemed', 5),
    (2, 5, 'Unredeemed', 1),
    (5, 9, 'Redeemed', 2),
    (8, 5, 'Unredeemed', 3),
    (12, 9, 'Redeemed', 4),
    (15, 5, 'Unredeemed', 5),
    (19, 9, 'Redeemed', 1),
    (21, 5, 'Unredeemed', 2),
    (22, 9, 'Redeemed', 3),
    (25, 5, 'Unredeemed', 4),
    (27, 9, 'Redeemed', 5),
    (11, 5, 'Unredeemed', 1),
    (2, 9, 'Redeemed', 2),
    (5, 5, 'Unredeemed', 3),
    (8, 9, 'Redeemed', 4),
    (12, 5, 'Unredeemed', 5),
    (15, 9, 'Redeemed', 1),
    (19, 5, 'Unredeemed', 2),
    (21, 9, 'Redeemed', 3),
    (22, 5, 'Unredeemed', 4),
    (25, 9, 'Redeemed', 5)
"""

try:
    cursor.execute(insert_query_couponsTable)
    db_connection.commit()
    print("Sample Coupons records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Coupons records created successfully!

## Insert sample records into the Salaries table

In [37]:
# Insert sample records into the Salaries table
insert_query_salariesTable = """
    INSERT INTO Salaries (employeeID, salaryAmount, hoursWorked, hourlyPay, fixedPay, monthYear)
    VALUES
    -- Full-Time Employees (Fixed Pay is yearly, Salary Amount is monthly)
    (1, 4166.67, NULL, NULL, 50000, '2024-11'),  -- 50000/12 = 4166.67
    (3, 3750.00, NULL, NULL, 45000, '2024-11'),  -- 45000/12 = 3750.00
    (4, 4000.00, NULL, NULL, 48000, '2024-11'),  -- 48000/12 = 4000.00
    (6, 4166.67, NULL, NULL, 50000, '2024-11'),  -- Another Full-Time Employee
    (10, 3750.00, NULL, NULL, 45000, '2024-11'), -- Another Full-Time Employee
    (1, 4166.67, NULL, NULL, 50000, '2024-12'),  -- Monthly salary for December
    (3, 3750.00, NULL, NULL, 45000, '2024-12'),
    (4, 4000.00, NULL, NULL, 48000, '2024-12'),
    (6, 4166.67, NULL, NULL, 50000, '2024-12'),
    (10, 3750.00, NULL, NULL, 45000, '2024-12'),

    -- Part-Time Employees (Hourly Pay provided, Salary Amount calculated, hoursWorked max is 80)
    (2, 600, 60, 10, NULL, '2024-11'),          -- 80 hours worked, hourly pay $10
    (5, 400, 40, 10, NULL, '2024-11'),          -- 40 hours worked, hourly pay $10
    (8, 600, 60, 10, NULL, '2024-11'),          -- 60 hours worked, hourly pay $10
    (12, 720, 72, 10, NULL, '2024-11'),         -- 72 hours worked, hourly pay $10
    (15, 560, 56, 10, NULL, '2024-11'),         -- 56 hours worked, hourly pay $10
    (19, 800, 80, 10, NULL, '2024-11'),         -- 80 hours worked, hourly pay $10
    (22, 700, 70, 10, NULL, '2024-11'),         -- 70 hours worked, hourly pay $10
    (2, 800, 80, 10, NULL, '2024-12'),          -- 80 hours worked, hourly pay $10
    (5, 400, 40, 10, NULL, '2024-12'),          -- 40 hours worked, hourly pay $10
    (8, 600, 60, 10, NULL, '2024-12'),          -- 60 hours worked, hourly pay $10
    (12, 720, 72, 10, NULL, '2024-12'),         -- 72 hours worked, hourly pay $10
    (15, 560, 56, 10, NULL, '2024-12'),         -- 56 hours worked, hourly pay $10
    (19, 800, 80, 10, NULL, '2024-12'),         -- 80 hours worked, hourly pay $10
    (22, 700, 70, 10, NULL, '2024-12')          -- 70 hours worked, hourly pay $10

"""

try:
    cursor.execute(insert_query_salariesTable)
    db_connection.commit()
    print("Sample Salaries records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Salaries records created successfully!

In [38]:
# Insert sample records into the Salaries table
insert_query_salariesTable = """
    INSERT INTO Salaries (employeeID, salaryAmount, hoursWorked, hourlyPay, fixedPay, monthYear)
    VALUES
    -- Full-Time Employees (Fixed Pay is yearly, Salary Amount is monthly)
    (7, 3750.00, NULL, NULL, 45000, '2024-12')
"""

try:
    cursor.execute(insert_query_salariesTable)
    db_connection.commit()
    print("Sample Salaries records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Salaries records created successfully!

## Insert sample records into the Vendor table

In [39]:
# Insert sample records into the Vendor table
insert_query_vendorTable = """
    INSERT INTO Vendor (firstName, middleName, lastName, phoneNum, emailID, aptNum, streetName, city, state, pincode, category)
    VALUES
    ('Alice', NULL, 'Supplier', '1234567890', 'alice.supplier@example.com', '12A', 'Supply Street', 'Denton', 'Texas', 76201, 'Food'),
    ('Bob', NULL, 'Caterer', '1234567891', 'bob.caterer@example.com', '34B', 'Vendor Lane', 'Frisco', 'Texas', 75033, 'Beverage'),
    ('Charlie', 'D', 'Wholesaler', '1234567892', 'charlie.wholesaler@example.com', '56C', 'Market Road', 'Aubrey', 'Texas', 76227, 'Utensils'),
    ('Daisy', 'E', 'Distributor', '1234567893', 'daisy.distributor@example.com', '78D', 'Trade Blvd', 'Plano', 'Texas', 75023, 'Supplies'),
    ('Ethan', NULL, 'Trader', '1234567894', 'ethan.trader@example.com', '90E', 'Commerce Avenue', 'Dallas', 'Texas', 75201, 'Food'),
    ('Fiona', 'F', 'Supplier', '1234567895', 'fiona.supplier@example.com', '11F', 'Main Street', 'Denton', 'Texas', 76202, 'Beverage'),
    ('George', NULL, 'Wholesaler', '1234567896', 'george.wholesaler@example.com', '22G', 'Central Road', 'Frisco', 'Texas', 75034, 'Utensils'),
    ('Hannah', NULL, 'Caterer', '1234567897', 'hannah.caterer@example.com', '33H', 'Event Street', 'Aubrey', 'Texas', 76228, 'Supplies'),
    ('Ian', 'I', 'Distributor', '1234567898', 'ian.distributor@example.com', '44I', 'Station Lane', 'Plano', 'Texas', 75024, 'Food'),
    ('Julia', 'J', 'Trader', '1234567899', 'julia.trader@example.com', '55J', 'Vendor Alley', 'Dallas', 'Texas', 75202, 'Beverage'),
    ('Kevin', NULL, 'Supplier', '12345678910', 'kevin.supplier@example.com', '66K', 'Market Boulevard', 'Denton', 'Texas', 76203, 'Utensils'),
    ('Laura', 'L', 'Caterer', '12345678911', 'laura.caterer@example.com', '77L', 'Trade Street', 'Frisco', 'Texas', 75035, 'Supplies'),
    ('Michael', NULL, 'Wholesaler', '12345678912', 'michael.wholesaler@example.com', '88M', 'Event Avenue', 'Aubrey', 'Texas', 76229, 'Food'),
    ('Nina', NULL, 'Distributor', '12345678913', 'nina.distributor@example.com', '99N', 'Commerce Street', 'Plano', 'Texas', 75025, 'Beverage'),
    ('Oliver', 'O', 'Trader', '12345678914', 'oliver.trader@example.com', '10O', 'Supply Road', 'Dallas', 'Texas', 75203, 'Utensils'),
    ('Paul', NULL, 'Supplier', '12345678915', 'paul.supplier@example.com', '21P', 'Vendor Lane', 'Denton', 'Texas', 76204, 'Supplies'),
    ('Quinn', 'Q', 'Caterer', '12345678916', 'quinn.caterer@example.com', '32Q', 'Market Street', 'Frisco', 'Texas', 75036, 'Food'),
    ('Rachel', NULL, 'Wholesaler', '12345678917', 'rachel.wholesaler@example.com', '43R', 'Event Boulevard', 'Aubrey', 'Texas', 76230, 'Beverage'),
    ('Steven', 'S', 'Distributor', '12345678918', 'steven.distributor@example.com', '54S', 'Trade Alley', 'Plano', 'Texas', 75026, 'Utensils'),
    ('Tina', NULL, 'Trader', '12345678919', 'tina.trader@example.com', '65T', 'Commerce Way', 'Dallas', 'Texas', 75204, 'Supplies'),
    ('Uma', 'U', 'Supplier', '12345678920', 'uma.supplier@example.com', '76U', 'Vendor Road', 'Denton', 'Texas', 76205, 'Food'),
    ('Victor', NULL, 'Caterer', '12345678921', 'victor.caterer@example.com', '87V', 'Market Lane', 'Frisco', 'Texas', 75037, 'Beverage'),
    ('Wendy', NULL, 'Wholesaler', '12345678922', 'wendy.wholesaler@example.com', '98W', 'Event Street', 'Aubrey', 'Texas', 76231, 'Utensils'),
    ('Xander', 'X', 'Distributor', '12345678923', 'xander.distributor@example.com', '10X', 'Supply Avenue', 'Plano', 'Texas', 75027, 'Supplies'),
    ('Yara', NULL, 'Trader', '12345678924', 'yara.trader@example.com', '20Y', 'Commerce Street', 'Dallas', 'Texas', 75205, 'Food'),
    ('Zane', 'Z', 'Supplier', '12345678925', 'zane.supplier@example.com', '30Z', 'Market Boulevard', 'Denton', 'Texas', 76206, 'Beverage'),
    ('Adam', 'A', 'Caterer', '12345678926', 'adam.caterer@example.com', '40A', 'Event Lane', 'Frisco', 'Texas', 75038, 'Utensils'),
    ('Bella', 'B', 'Wholesaler', '12345678927', 'bella.wholesaler@example.com', '50B', 'Vendor Avenue', 'Aubrey', 'Texas', 76232, 'Supplies'),
    ('Caleb', 'C', 'Distributor', '12345678928', 'caleb.distributor@example.com', '60C', 'Trade Boulevard', 'Plano', 'Texas', 75028, 'Food'),
    ('Diana', NULL, 'Trader', '12345678929', 'diana.trader@example.com', '70D', 'Market Street', 'Dallas', 'Texas', 75206, 'Beverage')
"""

try:
    cursor.execute(insert_query_vendorTable)
    db_connection.commit()
    print("Sample Vendor records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Vendor records created successfully!

## Insert sample records into the Inventory table

In [40]:
# Insert sample records into the Inventory table
insert_query_inventoryTable = """
    INSERT INTO Inventory (itemName, itemCategory, quantity, vendorID, eventID)
    VALUES
    ('Napkins', 'Supplies', 1000, 1, 1),
    ('Water Bottles', 'Beverage', 500, 2, 2),
    ('Plates', 'Utensils', 300, 3, 3),
    ('Spoons', 'Utensils', 200, 3, NULL),
    ('Tablecloths', 'Supplies', 50, 1, 4),
    ('Cups', 'Beverage', 600, 2, 5),
    ('Bowls', 'Utensils', 150, 3, 6),
    ('Serving Trays', 'Supplies', 30, 4, 7),
    ('Juice Bottles', 'Beverage', 400, 5, 8),
    ('Forks', 'Utensils', 250, 3, NULL),
    ('Chairs', 'Supplies', 100, 6, 9),
    ('Soft Drinks', 'Beverage', 350, 7, 10),
    ('Glasses', 'Utensils', 200, 3, 11),
    ('Ice Buckets', 'Supplies', 40, 8, 12),
    ('Wine Bottles', 'Beverage', 150, 9, 13),
    ('Dish Towels', 'Supplies', 80, 1, 14),
    ('Knives', 'Utensils', 100, 3, NULL),
    ('Coffee Cups', 'Beverage', 300, 2, 15),
    ('Serving Bowls', 'Utensils', 100, 3, 16),
    ('Cutlery Set', 'Supplies', 50, 10, NULL),
    ('Disposable Cups', 'Beverage', 400, 11, 17),
    ('Plastic Plates', 'Supplies', 200, 3, 18),
    ('Silverware', 'Utensils', 80, 12, 19),
    ('Beer Cans', 'Beverage', 250, 2, 20),
    ('Decorative Lights', 'Supplies', 15, 13, NULL),
    ('Cocktail Glasses', 'Utensils', 120, 3, 21),
    ('Appetizer Plates', 'Supplies', 60, 14, 22),
    ('Table Mats', 'Supplies', 200, 1, NULL),
    ('Sparkling Water', 'Beverage', 300, 5, 23),
    ('Bar Tools', 'Supplies', 20, 15, 24)
"""

try:
    cursor.execute(insert_query_inventoryTable)
    db_connection.commit()
    print("Sample Inventory records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample Inventory records created successfully!

## Insert sample records into the EmployeeEventAssignments table

In [41]:
# Insert sample records into the EmployeeEventAssignments table
insert_query_employeeEventAssignmentsTable = """
    INSERT INTO EmployeeEventAssignments (employeeID, eventID, taskDescription)
    VALUES
    (2, 1, 'Set up venue'),
    (3, 1, 'Coordinate logistics'),
    (4, 2, 'Serve food'),
    (5, 3, 'Arrange supplies'),
    (6, 4, 'Manage guest seating'),
    (2, 5, 'Assist with decorations'),
    (3, 5, 'Serve food'),
    (8, 6, 'Set up sound system'),
    (12, 7, 'Manage event flow'),
    (15, 8, 'Clean up post-event'),
    (19, 9, 'Distribute beverages'),
    (22, 10, 'Help with setup'),
    (25, 11, 'Handle registration'),
    (27, 12, 'Supervise activities'),
    (11, 13, 'Coordinate security'),
    (2, 14, 'Help with decorations'),
    (5, 15, 'Manage guest list'),
    (8, 16, 'Arrange seating'),
    (12, 17, 'Support logistics team'),
    (15, 18, 'Oversee food delivery'),
    (19, 19, 'Prepare venue for event'),
    (22, 20, 'Monitor event operations'),
    (25, 21, 'Coordinate with vendors'),
    (27, 22, 'Supervise part-time staff'),
    (11, 23, 'Set up lighting'),
    (2, 24, 'Handle guest complaints'),
    (3, 25, 'Help with packing'),
    (4, 26, 'Assist in inventory'),
    (5, 27, 'Supervise entrance'),
    (6, 28, 'Manage technical equipment')
"""

try:
    cursor.execute(insert_query_employeeEventAssignmentsTable)
    db_connection.commit()
    print("Sample EmployeeEventAssignments records created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")
    db_connection.rollback()

Sample EmployeeEventAssignments records created successfully!

## Query to fetch data from all tables

In [42]:
# Query to fetch data from a specific table
tables_to_view = ["Role", "Employee", "Location", "Events", "Coupons", "Salaries", "Vendor", "Inventory", "EmployeeEventAssignments"]

for table in tables_to_view:
    print(f"\n--- Data from {table} Table ---")
    cursor.execute(f"SELECT * FROM {table}")
    rows = cursor.fetchall()
    for row in rows:
        print(row)

--- Data from Role Table ---
(1, 'Manager', 1, 1, 1, 1, 1)
(2, 'Supervisor', 0, 1, 0, 1, 1)
(3, 'Non-Supervisor', 0, 0, 0, 0, 0)
(4, 'PartTime-Employee', 0, 0, 0, 0, 0)

--- Data from Employee Table ---
(1, 'John', 'M', 'Doe', '1234567890', 'john.doe@example.com', '1A', 'Main Street', 'Denton', 'Texas', 76201, 'Male', 'Full-Time', 1)
(2, 'Jane', 'A', 'Smith', '1234567891', 'jane.smith@example.com', '2B', 'Elm Street', 'Frisco', 'Texas', 75033, 'Female', 'Part-Time', 4)
(3, 'Robert', 'B', 'Johnson', '1234567892', 'robert.johnson@example.com', '3C', 'Pine Street', 'Aubrey', 'Texas', 76227, 'Male', 'Full-Time', 2)
(4, 'Alice', None, 'Brown', '1234567893', 'alice.brown@example.com', None, 'Oak Street', 'Plano', 'Texas', 75023, 'Female', 'Full-Time', 3)
(5, 'Michael', None, 'Davis', '1234567894', 'michael.davis@example.com', '5D', 'Maple Street', 'Dallas', 'Texas', 75201, 'Male', 'Part-Time', 4)
(6, 'Emily', 'J', 'Clark', '1234567895', 'emily.clark@example.com', '6E', 'Cedar Street', 'Denton', 'Texas', 76202, 'Female', 'Full-Time', 1)
(7, 'Chris', 'L', 'Evans', '1234567896', 'chris.evans@example.com', None, 'Birch Street', 'Frisco', 'Texas', 75034, 'Male', 'Full-Time', 2)
(8, 'Sarah', None, 'Wilson', '1234567897', 'sarah.wilson@example.com', '8F', 'Ash Street', 'Aubrey', 'Texas', 76228, 'Female', 'Part-Time', 4)
(9, 'David', 'A', 'Taylor', '1234567898', 'david.taylor@example.com', '9G', 'Spruce Street', 'Plano', 'Texas', 75024, 'Male', 'Full-Time', 3)
(10, 'Laura', 'K', 'Martinez', '1234567899', 'laura.martinez@example.com', None, 'Willow Street', 'Dallas', 'Texas', 75202, 'Female', 'Full-Time', 1)
(11, 'Daniel', 'P', 'Garcia', '12345678910', 'daniel.garcia@example.com', '10H', 'Oak Drive', 'Denton', 'Texas', 76203, 'Male', 'Part-Time', 4)
(12, 'Sophia', None, 'Miller', '12345678911', 'sophia.miller@example.com', '11I', 'Cypress Lane', 'Frisco', 'Texas', 75035, 'Female', 'Part-Time', 4)
(13, 'Ethan', 'Q', 'Rodriguez', '12345678912', 'ethan.rodriguez@example.com', '12J', 'Hickory Road', 'Aubrey', 'Texas', 76229, 'Male', 'Full-Time', 3)
(14, 'Olivia', 'R', 'Martinez', '12345678913', 'olivia.martinez@example.com', '13K', 'Aspen Way', 'Plano', 'Texas', 75025, 'Female', 'Part-Time', 4)
(15, 'Benjamin', None, 'Lee', '12345678914', 'benjamin.lee@example.com', None, 'Sequoia Blvd', 'Dallas', 'Texas', 75203, 'Male', 'Part-Time', 4)
(16, 'Emma', 'S', 'Perez', '12345678915', 'emma.perez@example.com', '14L', 'Magnolia Street', 'Denton', 'Texas', 76204, 'Female', 'Full-Time', 2)
(17, 'Noah', None, 'Moore', '12345678916', 'noah.moore@example.com', '15M', 'Cedar Grove', 'Frisco', 'Texas', 75036, 'Male', 'Full-Time', 3)
(18, 'Isabella', 'T', 'Flores', '12345678917', 'isabella.flores@example.com', '16N', 'Elm Grove', 'Aubrey', 'Texas', 76230, 'Female', 'Full-Time', 1)
(19, 'James', None, 'Anderson', '12345678918', 'james.anderson@example.com', '17O', 'Birch Trail', 'Plano', 'Texas', 75026, 'Male', 'Part-Time', 4)
(20, 'Charlotte', 'U', 'Lopez', '12345678919', 'charlotte.lopez@example.com', None, 'Palm Way', 'Dallas', 'Texas', 75204, 'Female', 'Full-Time', 2)
(21, 'Alexander', None, 'King', '12345678920', 'alexander.king@example.com', '18P', 'Maple Trail', 'Denton', 'Texas', 76205, 'Male', 'Part-Time', 4)
(22, 'Amelia', 'V', 'Scott', '12345678921', 'amelia.scott@example.com', '19Q', 'Hickory Lane', 'Frisco', 'Texas', 75037, 'Female', 'Part-Time', 4)
(23, 'Mason', None, 'Torres', '12345678922', 'mason.torres@example.com', None, 'Spruce Drive', 'Aubrey', 'Texas', 76231, 'Male', 'Full-Time', 1)
(24, 'Harper', 'W', 'Nguyen', '12345678923', 'harper.nguyen@example.com', '20R', 'Cypress Trail', 'Plano', 'Texas', 75027, 'Female', 'Part-Time', 4)
(25, 'Elijah', 'X', 'Garcia', '12345678924', 'elijah.garcia@example.com', '21S', 'Sequoia Blvd', 'Dallas', 'Texas', 75205, 'Male', 'Part-Time', 4)
(26, 'Abigail', 'Y', 'Brown', '12345678925', 'abigail.brown@example.com', '22T', 'Aspen Avenue', 'Denton', 'Texas', 76206, 'Female', 'Full-Time', 1)
(27, 'Henry', None, 'Clark', '12345678926', 'henry.clark@example.com', None, 'Maple Road', 'Frisco', 'Texas', 75038, 'Male', 'Part-Time', 4)
(28, 'Sofia', 'Z', 'Lopez', '12345678927', 'sofia.lopez@example.com', '23U', 'Oakwood Drive', 'Aubrey', 'Texas', 76232, 'Female', 'Full-Time', 2)
(29, 'William', None, 'Jones', '12345678928', 'william.jones@example.com', '24V', 'Pine Circle', 'Plano', 'Texas', 75028, 'Male', 'Part-Time', 4)
(30, 'Mia', 'A', 'Scott', '12345678929', 'mia.scott@example.com', '25W', 'Cypress Avenue', 'Dallas', 'Texas', 75206, 'Female', 'Full-Time', 3)

--- Data from Location Table ---
(1, 'Main Hall', 'First Ave', 'Denton', 'Texas', 76201, 500, 'Yes', 'Available for all events', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(2, 'Conference Room', 'Second Ave', 'Denton', 'Texas', 76202, 200, 'Yes', 'Equipped with projectors', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(3, 'Outdoor Park', 'Park Lane', 'Denton', 'Texas', 76203, 1000, 'No', 'Under Maintenance', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(4, 'Banquet Hall', 'Third Ave', 'Frisco', 'Texas', 75033, 300, 'Yes', 'Ideal for weddings', 4, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(5, 'Sports Ground', 'Fourth Ave', 'Frisco', 'Texas', 75034, 1500, 'Yes', 'Available for sports events', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(6, 'Community Center', 'Fifth Ave', 'Frisco', 'Texas', 75035, 400, 'Yes', 'Used for meetings', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(7, 'Town Hall', 'Sixth Ave', 'Aubrey', 'Texas', 76227, 800, 'Yes', 'Open for public events', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(8, 'Open Air Stage', 'Seventh Ave', 'Aubrey', 'Texas', 76228, 1200, 'Yes', 'Available for concerts', 4, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(9, 'Gallery', 'Eighth Ave', 'Aubrey', 'Texas', 76229, 200, 'Yes', 'For exhibitions', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(10, 'Training Center', 'Ninth Ave', 'Plano', 'Texas', 75023, 250, 'Yes', 'For training sessions', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(11, 'Exhibition Hall', 'Tenth Ave', 'Plano', 'Texas', 75024, 600, 'No', 'Reserved for expo', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(12, 'Sports Complex', 'Eleventh Ave', 'Plano', 'Texas', 75025, 2000, 'Yes', 'Available for sports events', 6, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(13, 'Convention Center', 'Twelfth Ave', 'Dallas', 'Texas', 75201, 1500, 'Yes', 'For conventions', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(14, 'Lecture Hall', 'Thirteenth Ave', 'Dallas', 'Texas', 75202, 250, 'Yes', 'Used for seminars', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(15, 'Stadium', 'Fourteenth Ave', 'Dallas', 'Texas', 75203, 3000, 'Yes', 'Open for large events', 6, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(16, 'Amphitheater', 'Fifteenth Ave', 'Denton', 'Texas', 76204, 800, 'Yes', 'Ideal for plays', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(17, 'Library Hall', 'Sixteenth Ave', 'Denton', 'Texas', 76205, 150, 'Yes', 'Available for meetings', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(18, 'Science Center', 'Seventeenth Ave', 'Frisco', 'Texas', 75036, 600, 'No', 'Under Renovation', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(19, 'Music Hall', 'Eighteenth Ave', 'Frisco', 'Texas', 75037, 400, 'Yes', 'For music recitals', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(20, 'Green Park', 'Nineteenth Ave', 'Aubrey', 'Texas', 76230, 1000, 'Yes', 'Available for public events', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(21, 'Auditorium', 'Twentieth Ave', 'Aubrey', 'Texas', 76231, 700, 'Yes', 'Ideal for conferences', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(22, 'Cinema Hall', 'Twenty-First Ave', 'Plano', 'Texas', 75026, 300, 'Yes', 'Available for film events', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(23, 'Playground', 'Twenty-Second Ave', 'Plano', 'Texas', 75027, 1200, 'Yes', 'Open for recreational events', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(24, 'Sports Pavilion', 'Twenty-Third Ave', 'Dallas', 'Texas', 75204, 800, 'Yes', 'For sports and games', 4, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(25, 'Art Gallery', 'Twenty-Fourth Ave', 'Dallas', 'Texas', 75205, 300, 'Yes', 'For art exhibitions', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(26, 'Tech Center', 'Twenty-Fifth Ave', 'Denton', 'Texas', 76206, 600, 'Yes', 'For tech expos', 3, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(27, 'Community Hall', 'Twenty-Sixth Ave', 'Frisco', 'Texas', 75038, 200, 'Yes', 'For community events', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(28, 'Riverfront Stage', 'Twenty-Seventh Ave', 'Aubrey', 'Texas', 76232, 900, 'Yes', 'For open-air performances', 4, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')
(29, 'Boardroom', 'Twenty-Eighth Ave', 'Plano', 'Texas', 75028, 100, 'Yes', 'For corporate meetings', 2, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Indoor')
(30, 'Outdoor Arena', 'Twenty-Ninth Ave', 'Dallas', 'Texas', 75206, 2500, 'No', 'Reserved for private events', 5, datetime.datetime(2024, 12, 2, 16, 30, 40), 'Outdoor')

--- Data from Events Table ---
(1, 'Annual Gala', 1, datetime.datetime(2024, 7, 1, 18, 0), 4, 1, 2, 'Yes')
(2, 'Tech Conference', 2, datetime.datetime(2024, 7, 5, 9, 0), 6, 1, 3, 'Yes')
(3, 'Music Festival', 3, datetime.datetime(2024, 7, 10, 16, 0), 8, 2, 4, 'No')
(4, 'Wedding Reception', 4, datetime.datetime(2024, 7, 15, 19, 0), 5, 3, 5, 'Yes')
(5, 'Sports Meet', 5, datetime.datetime(2024, 7, 20, 8, 0), 7, 1, 2, 'Yes')
(6, 'Food Expo', 6, datetime.datetime(2024, 8, 1, 12, 0), 3, 2, 3, 'Yes')
(7, 'Charity Ball', 7, datetime.datetime(2024, 8, 5, 19, 30), 4, 1, 4, 'Yes')
(8, 'Corporate Meetup', 8, datetime.datetime(2024, 8, 10, 10, 0), 6, 2, 5, 'Yes')
(9, 'Art Exhibition', 9, datetime.datetime(2024, 8, 15, 14, 0), 2, 3, 2, 'Yes')
(10, 'Product Launch', 10, datetime.datetime(2024, 8, 20, 11, 0), 7, 1, 3, 'Yes')
(11, 'Town Hall Meeting', 11, datetime.datetime(2024, 8, 25, 17, 0), 3, 2, 4, 'No')
(12, 'Music Recital', 12, datetime.datetime(2024, 9, 1, 15, 0), 8, 3, 5, 'Yes')
(13, 'Book Fair', 13, datetime.datetime(2024, 9, 5, 9, 0), 6, 1, 2, 'Yes')
(14, 'Film Screening', 14, datetime.datetime(2024, 9, 10, 20, 0), 5, 2, 3, 'Yes')
(15, 'Training Workshop', 15, datetime.datetime(2024, 9, 15, 10, 0), 4, 3, 4, 'Yes')
(16, 'Open Mic Night', 16, datetime.datetime(2024, 9, 20, 19, 0), 3, 1, 5, 'No')
(17, 'Hackathon', 17, datetime.datetime(2024, 9, 25, 8, 0), 7, 2, 2, 'Yes')
(18, 'Startup Showcase', 18, datetime.datetime(2024, 10, 1, 11, 30), 8, 3, 3, 'Yes')
(19, 'Science Fair', 19, datetime.datetime(2024, 10, 5, 10, 0), 5, 1, 4, 'Yes')
(20, 'Cultural Fest', 20, datetime.datetime(2024, 10, 10, 17, 0), 6, 2, 5, 'Yes')
(21, 'Sports Day', 21, datetime.datetime(2024, 10, 15, 9, 0), 3, 3, 2, 'Yes')
(22, 'Networking Event', 22, datetime.datetime(2024, 10, 20, 13, 0), 2, 1, 3, 'No')
(23, 'Team Building Retreat', 23, datetime.datetime(2024, 10, 25, 9, 0), 4, 2, 4, 'Yes')
(24, 'Fundraiser', 24, datetime.datetime(2024, 11, 1, 18, 0), 7, 3, 5, 'Yes')
(25, 'Gaming Tournament', 25, datetime.datetime(2024, 11, 5, 10, 0), 8, 1, 2, 'Yes')
(26, 'Halloween Party', 26, datetime.datetime(2024, 11, 10, 19, 0), 6, 2, 3, 'Yes')
(27, 'Business Conference', 27, datetime.datetime(2024, 11, 15, 11, 0), 4, 3, 4, 'Yes')
(28, 'Holiday Market', 28, datetime.datetime(2024, 11, 20, 15, 0), 5, 1, 5, 'No')
(29, 'Cooking Contest', 29, datetime.datetime(2024, 11, 25, 10, 0), 3, 2, 2, 'Yes')
(30, 'Thanksgiving Feast', 30, datetime.datetime(2024, 11, 30, 18, 30), 6, 3, 3, 'Yes')
(31, 'Annual Conference', 1, datetime.datetime(2024, 12, 1, 8, 0), 8, 1, 4, 'Yes')
(32, 'Winter Concert', 2, datetime.datetime(2024, 12, 5, 19, 0), 5, 2, 5, 'Yes')
(33, 'Company Dinner', 3, datetime.datetime(2024, 12, 10, 18, 0), 3, 3, 2, 'Yes')
(34, 'Winter Carnival', 4, datetime.datetime(2024, 12, 15, 10, 0), 4, 1, 3, 'Yes')
(35, 'Christmas Party', 5, datetime.datetime(2024, 12, 20, 20, 0), 6, 2, 4, 'Yes')
(36, 'New Year Bash', 6, datetime.datetime(2024, 12, 25, 23, 0), 8, 3, 5, 'Yes')
(37, 'Dance Festival', 7, datetime.datetime(2024, 7, 15, 18, 30), 4, 1, 2, 'Yes')
(38, 'Poetry Slam', 8, datetime.datetime(2024, 8, 20, 15, 30), 5, 2, 3, 'Yes')
(39, 'Volunteer Meetup', 9, datetime.datetime(2024, 9, 12, 9, 30), 3, 3, 4, 'No')
(40, 'Marketing Expo', 10, datetime.datetime(2024, 10, 8, 14, 0), 7, 1, 5, 'Yes')
(41, 'Literature Fest', 11, datetime.datetime(2024, 11, 2, 12, 0), 6, 2, 2, 'Yes')
(42, 'Robotics Fair', 12, datetime.datetime(2024, 12, 11, 13, 0), 8, 3, 3, 'Yes')
(43, 'Debate Tournament', 13, datetime.datetime(2024, 11, 30, 16, 30), 4, 1, 4, 'Yes')
(44, 'Music Jam', 14, datetime.datetime(2024, 8, 5, 19, 30), 3, 2, 5, 'Yes')
(45, 'Health Seminar', 15, datetime.datetime(2024, 7, 22, 10, 0), 6, 3, 2, 'Yes')
(46, 'Tech Meetup', 16, datetime.datetime(2024, 9, 18, 14, 0), 5, 1, 3, 'Yes')
(47, 'Environmental Summit', 17, datetime.datetime(2024, 10, 22, 10, 0), 4, 2, 4, 'No')
(48, 'Employee Appreciation Night', 18, datetime.datetime(2024, 11, 28, 19, 0), 7, 3, 5, 'Yes')
(49, 'Culinary Show', 19, datetime.datetime(2024, 12, 12, 18, 30), 8, 1, 2, 'Yes')
(50, 'Research Symposium', 20, datetime.datetime(2024, 12, 14, 9, 0), 6, 2, 3, 'Yes')

--- Data from Coupons Table ---
(1, 2, 5, 'Unredeemed', 1)
(2, 5, 9, 'Redeemed', 2)
(3, 8, 5, 'Unredeemed', 3)
(4, 12, 9, 'Redeemed', 4)
(5, 15, 5, 'Unredeemed', 5)
(6, 19, 9, 'Redeemed', 1)
(7, 21, 5, 'Unredeemed', 2)
(8, 22, 9, 'Redeemed', 3)
(9, 25, 5, 'Unredeemed', 4)
(10, 27, 9, 'Redeemed', 5)
(11, 11, 5, 'Unredeemed', 1)
(12, 8, 9, 'Redeemed', 2)
(13, 12, 5, 'Unredeemed', 3)
(14, 15, 9, 'Redeemed', 4)
(15, 19, 5, 'Unredeemed', 5)
(16, 21, 9, 'Redeemed', 1)
(17, 22, 5, 'Unredeemed', 2)
(18, 25, 9, 'Redeemed', 3)
(19, 29, 5, 'Unredeemed', 4)
(20, 21, 9, 'Redeemed', 5)
(21, 2, 5, 'Unredeemed', 1)
(22, 5, 9, 'Redeemed', 2)
(23, 8, 5, 'Unredeemed', 3)
(24, 12, 9, 'Redeemed', 4)
(25, 15, 5, 'Unredeemed', 5)
(26, 19, 9, 'Redeemed', 1)
(27, 21, 5, 'Unredeemed', 2)
(28, 22, 9, 'Redeemed', 3)
(29, 25, 5, 'Unredeemed', 4)
(30, 27, 9, 'Redeemed', 5)
(31, 11, 5, 'Unredeemed', 1)
(32, 2, 9, 'Redeemed', 2)
(33, 5, 5, 'Unredeemed', 3)
(34, 8, 9, 'Redeemed', 4)
(35, 12, 5, 'Unredeemed', 5)
(36, 15, 9, 'Redeemed', 1)
(37, 19, 5, 'Unredeemed', 2)
(38, 21, 9, 'Redeemed', 3)
(39, 22, 5, 'Unredeemed', 4)
(40, 25, 9, 'Redeemed', 5)

--- Data from Salaries Table ---
(1, 1, 4167, None, None, 50000, '2024-11')
(2, 3, 3750, None, None, 45000, '2024-11')
(3, 4, 4000, None, None, 48000, '2024-11')
(4, 6, 4167, None, None, 50000, '2024-11')
(5, 10, 3750, None, None, 45000, '2024-11')
(6, 1, 4167, None, None, 50000, '2024-12')
(7, 3, 3750, None, None, 45000, '2024-12')
(8, 4, 4000, None, None, 48000, '2024-12')
(9, 6, 4167, None, None, 50000, '2024-12')
(10, 10, 3750, None, None, 45000, '2024-12')
(11, 2, 600, 60, 10, None, '2024-11')
(12, 5, 400, 40, 10, None, '2024-11')
(13, 8, 600, 60, 10, None, '2024-11')
(14, 12, 720, 72, 10, None, '2024-11')
(15, 15, 560, 56, 10, None, '2024-11')
(16, 19, 800, 80, 10, None, '2024-11')
(17, 22, 700, 70, 10, None, '2024-11')
(18, 2, 800, 80, 10, None, '2024-12')
(19, 5, 400, 40, 10, None, '2024-12')
(20, 8, 600, 60, 10, None, '2024-12')
(21, 12, 720, 72, 10, None, '2024-12')
(22, 15, 560, 56, 10, None, '2024-12')
(23, 19, 800, 80, 10, None, '2024-12')
(24, 22, 700, 70, 10, None, '2024-12')
(25, 7, 3750, None, None, 45000, '2024-12')

--- Data from Vendor Table ---
(1, 'Alice', None, 'Supplier', '1234567890', 'alice.supplier@example.com', '12A', 'Supply Street', 'Denton', 'Texas', 76201, 'Food')
(2, 'Bob', None, 'Caterer', '1234567891', 'bob.caterer@example.com', '34B', 'Vendor Lane', 'Frisco', 'Texas', 75033, 'Beverage')
(3, 'Charlie', 'D', 'Wholesaler', '1234567892', 'charlie.wholesaler@example.com', '56C', 'Market Road', 'Aubrey', 'Texas', 76227, 'Utensils')
(4, 'Daisy', 'E', 'Distributor', '1234567893', 'daisy.distributor@example.com', '78D', 'Trade Blvd', 'Plano', 'Texas', 75023, 'Supplies')
(5, 'Ethan', None, 'Trader', '1234567894', 'ethan.trader@example.com', '90E', 'Commerce Avenue', 'Dallas', 'Texas', 75201, 'Food')
(6, 'Fiona', 'F', 'Supplier', '1234567895', 'fiona.supplier@example.com', '11F', 'Main Street', 'Denton', 'Texas', 76202, 'Beverage')
(7, 'George', None, 'Wholesaler', '1234567896', 'george.wholesaler@example.com', '22G', 'Central Road', 'Frisco', 'Texas', 75034, 'Utensils')
(8, 'Hannah', None, 'Caterer', '1234567897', 'hannah.caterer@example.com', '33H', 'Event Street', 'Aubrey', 'Texas', 76228, 'Supplies')
(9, 'Ian', 'I', 'Distributor', '1234567898', 'ian.distributor@example.com', '44I', 'Station Lane', 'Plano', 'Texas', 75024, 'Food')
(10, 'Julia', 'J', 'Trader', '1234567899', 'julia.trader@example.com', '55J', 'Vendor Alley', 'Dallas', 'Texas', 75202, 'Beverage')
(11, 'Kevin', None, 'Supplier', '12345678910', 'kevin.supplier@example.com', '66K', 'Market Boulevard', 'Denton', 'Texas', 76203, 'Utensils')
(12, 'Laura', 'L', 'Caterer', '12345678911', 'laura.caterer@example.com', '77L', 'Trade Street', 'Frisco', 'Texas', 75035, 'Supplies')
(13, 'Michael', None, 'Wholesaler', '12345678912', 'michael.wholesaler@example.com', '88M', 'Event Avenue', 'Aubrey', 'Texas', 76229, 'Food')
(14, 'Nina', None, 'Distributor', '12345678913', 'nina.distributor@example.com', '99N', 'Commerce Street', 'Plano', 'Texas', 75025, 'Beverage')
(15, 'Oliver', 'O', 'Trader', '12345678914', 'oliver.trader@example.com', '10O', 'Supply Road', 'Dallas', 'Texas', 75203, 'Utensils')
(16, 'Paul', None, 'Supplier', '12345678915', 'paul.supplier@example.com', '21P', 'Vendor Lane', 'Denton', 'Texas', 76204, 'Supplies')
(17, 'Quinn', 'Q', 'Caterer', '12345678916', 'quinn.caterer@example.com', '32Q', 'Market Street', 'Frisco', 'Texas', 75036, 'Food')
(18, 'Rachel', None, 'Wholesaler', '12345678917', 'rachel.wholesaler@example.com', '43R', 'Event Boulevard', 'Aubrey', 'Texas', 76230, 'Beverage')
(19, 'Steven', 'S', 'Distributor', '12345678918', 'steven.distributor@example.com', '54S', 'Trade Alley', 'Plano', 'Texas', 75026, 'Utensils')
(20, 'Tina', None, 'Trader', '12345678919', 'tina.trader@example.com', '65T', 'Commerce Way', 'Dallas', 'Texas', 75204, 'Supplies')
(21, 'Uma', 'U', 'Supplier', '12345678920', 'uma.supplier@example.com', '76U', 'Vendor Road', 'Denton', 'Texas', 76205, 'Food')
(22, 'Victor', None, 'Caterer', '12345678921', 'victor.caterer@example.com', '87V', 'Market Lane', 'Frisco', 'Texas', 75037, 'Beverage')
(23, 'Wendy', None, 'Wholesaler', '12345678922', 'wendy.wholesaler@example.com', '98W', 'Event Street', 'Aubrey', 'Texas', 76231, 'Utensils')
(24, 'Xander', 'X', 'Distributor', '12345678923', 'xander.distributor@example.com', '10X', 'Supply Avenue', 'Plano', 'Texas', 75027, 'Supplies')
(25, 'Yara', None, 'Trader', '12345678924', 'yara.trader@example.com', '20Y', 'Commerce Street', 'Dallas', 'Texas', 75205, 'Food')
(26, 'Zane', 'Z', 'Supplier', '12345678925', 'zane.supplier@example.com', '30Z', 'Market Boulevard', 'Denton', 'Texas', 76206, 'Beverage')
(27, 'Adam', 'A', 'Caterer', '12345678926', 'adam.caterer@example.com', '40A', 'Event Lane', 'Frisco', 'Texas', 75038, 'Utensils')
(28, 'Bella', 'B', 'Wholesaler', '12345678927', 'bella.wholesaler@example.com', '50B', 'Vendor Avenue', 'Aubrey', 'Texas', 76232, 'Supplies')
(29, 'Caleb', 'C', 'Distributor', '12345678928', 'caleb.distributor@example.com', '60C', 'Trade Boulevard', 'Plano', 'Texas', 75028, 'Food')
(30, 'Diana', None, 'Trader', '12345678929', 'diana.trader@example.com', '70D', 'Market Street', 'Dallas', 'Texas', 75206, 'Beverage')

--- Data from Inventory Table ---
(1, 'Napkins', 'Supplies', 1000, 1, 1)
(2, 'Water Bottles', 'Beverage', 500, 2, 2)
(3, 'Plates', 'Utensils', 300, 3, 3)
(4, 'Spoons', 'Utensils', 200, 3, None)

## This query calculates the total salary paid to employees in December 2024, grouped by their employment type (e.g., Full-Time, Part-Time).

In [43]:
# Query to calculate total salary paid by employment type for December 2024
query = """
SELECT
    e.employmentType,
    SUM(s.salaryAmount) AS totalSalaryPaid
FROM
    Employee e
JOIN
    Salaries s ON e.employeeID = s.employeeID
WHERE
    s.monthYear = '2024-12'
GROUP BY
    e.employmentType;
"""

try:
    # Execute the query
    cursor.execute(query)

    # Fetch all results
    results = cursor.fetchall()

    # Print the results
    print("Total Salary Paid by Employment Type for the month:")
    for row in results:
        employment_type = row[0]
        total_salary_paid = row[1]
        print(f"Employment Type: {employment_type}, Total Salary Paid: {total_salary_paid:.2f}")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Total Salary Paid by Employment Type for the month:
Employment Type: Full-Time, Total Salary Paid: 23584.00
Employment Type: Part-Time, Total Salary Paid: 4580.00

## This query counts the number of events hosted at each location and orders the results by the total number of events in descending order (most events first).

In [44]:
query = """
SELECT
    l.locationName,
    COUNT(e.eventID) AS eventCount
FROM
    Location l
JOIN
    Events e ON l.locationID = e.locationID
GROUP BY
    l.locationName
ORDER BY
    eventCount DESC;
"""

cursor.execute(query)
results = cursor.fetchall()

for row in results:
    print(f"Location Name: {row[0]}, Event Count: {row[1]}")

Location Name: Conference Room, Event Count: 2
Location Name: Green Park, Event Count: 2
Location Name: Music Hall, Event Count: 2
Location Name: Science Center, Event Count: 2
Location Name: Library Hall, Event Count: 2
Location Name: Amphitheater, Event Count: 2
Location Name: Stadium, Event Count: 2
Location Name: Lecture Hall, Event Count: 2
Location Name: Convention Center, Event Count: 2
Location Name: Sports Complex, Event Count: 2
Location Name: Training Center, Event Count: 2
Location Name: Gallery, Event Count: 2
Location Name: Open Air Stage, Event Count: 2
Location Name: Town Hall, Event Count: 2
Location Name: Community Center, Event Count: 2
Location Name: Sports Ground, Event Count: 2
Location Name: Banquet Hall, Event Count: 2
Location Name: Outdoor Park, Event Count: 2
Location Name: Main Hall, Event Count: 2
Location Name: Exhibition Hall, Event Count: 2
Location Name: Outdoor Arena, Event Count: 1
Location Name: Boardroom, Event Count: 1
Location Name: Riverfront Stage, Event Count: 1
Location Name: Community Hall, Event Count: 1
Location Name: Tech Center, Event Count: 1
Location Name: Art Gallery, Event Count: 1
Location Name: Sports Pavilion, Event Count: 1
Location Name: Playground, Event Count: 1
Location Name: Cinema Hall, Event Count: 1
Location Name: Auditorium, Event Count: 1

## This query identifies the top 5 employees who have the highest number of event assignments and lists their first name, last name, and total number of assignments.

In [45]:
query = """
SELECT
    e.firstName,
    e.lastName,
    COUNT(eea.assignmentID) AS totalAssignments
FROM
    Employee e
JOIN
    EmployeeEventAssignments eea ON e.employeeID = eea.employeeID
GROUP BY
    e.employeeID
ORDER BY
    totalAssignments DESC
LIMIT 5;
"""

cursor.execute(query)
results = cursor.fetchall()

for row in results:
    print(f"Employee: {row[0]} {row[1]}, Total Assignments: {row[2]}")

Employee: Jane Smith, Total Assignments: 4
Employee: Robert Johnson, Total Assignments: 3
Employee: Michael Davis, Total Assignments: 3
Employee: Alice Brown, Total Assignments: 2
Employee: Emily Clark, Total Assignments: 2

## This query retrieves the top 5 employees with the highest number of event assignments, along with their first name, last name, total assignments, and a list of the names of the events they worked on.

In [46]:
query = """
SELECT
    e.firstName,
    e.lastName,
    COUNT(eea.assignmentID) AS totalAssignments,
    GROUP_CONCAT(ev.eventName SEPARATOR ', ') AS eventNames
FROM
    Employee e
JOIN
    EmployeeEventAssignments eea ON e.employeeID = eea.employeeID
JOIN
    Events ev ON eea.eventID = ev.eventID
GROUP BY
    e.employeeID
ORDER BY
    totalAssignments DESC
LIMIT 5;
"""

try:
    # Execute the query
    cursor.execute(query)

    # Fetch all results
    results = cursor.fetchall()

    # Print the results
    print("Top 5 Employees by Total Assignments with Event Details:")
    for row in results:
        employee_name = f"{row[0]} {row[1]}"
        total_assignments = row[2]
        event_names = row[3]
        print(f"Employee: {employee_name}, Total Assignments: {total_assignments}, Events: {event_names}")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Top 5 Employees by Total Assignments with Event Details:
Employee: Jane Smith, Total Assignments: 4, Events: Annual Gala, Sports Meet, Film Screening, Fundraiser
Employee: Robert Johnson, Total Assignments: 3, Events: Annual Gala, Sports Meet, Gaming Tournament
Employee: Michael Davis, Total Assignments: 3, Events: Music Festival, Training Workshop, Business Conference
Employee: Benjamin Lee, Total Assignments: 2, Events: Corporate Meetup, Startup Showcase
Employee: Henry Clark, Total Assignments: 2, Events: Music Recital, Networking Event

## This query retrieves information about the total number of coupons issued to each employee and how many of those coupons have been redeemed.

In [47]:
query = """
SELECT
    e.firstName,
    e.lastName,
    COUNT(c.couponID) AS totalCouponsIssued,
    SUM(CASE WHEN c.redemptionStatus = 'Redeemed' THEN 1 ELSE 0 END) AS totalCouponsRedeemed
FROM
    Employee e
JOIN
    Coupons c ON e.employeeID = c.employeeID
GROUP BY
    e.employeeID;
"""

cursor.execute(query)
results = cursor.fetchall()

for row in results:
    print(f"Employee: {row[0]} {row[1]}, Total Coupons Issued: {row[2]}, Total Coupons Redeemed: {row[3]}")

Employee: Jane Smith, Total Coupons Issued: 3, Total Coupons Redeemed: 1
Employee: Michael Davis, Total Coupons Issued: 3, Total Coupons Redeemed: 2
Employee: Sarah Wilson, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: Daniel Garcia, Total Coupons Issued: 2, Total Coupons Redeemed: 0
Employee: Sophia Miller, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: Benjamin Lee, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: James Anderson, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: Alexander King, Total Coupons Issued: 5, Total Coupons Redeemed: 3
Employee: Amelia Scott, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: Elijah Garcia, Total Coupons Issued: 4, Total Coupons Redeemed: 2
Employee: Henry Clark, Total Coupons Issued: 2, Total Coupons Redeemed: 2
Employee: William Jones, Total Coupons Issued: 1, Total Coupons Redeemed: 0

## This query retrieves the first name and last name of employees who are assigned to events taking place at the location with the maximum capacity.

In [48]:
# Define the subquery
query = """
SELECT firstName, lastName
FROM Employee
WHERE employeeID IN (
    SELECT employeeID
    FROM EmployeeEventAssignments
    WHERE eventID IN (
        SELECT eventID
        FROM Events
        WHERE locationID = (
            SELECT locationID
            FROM Location
            WHERE capacity = (SELECT MAX(capacity) FROM Location)
        )
    )
);
"""

try:
    # Execute the query
    cursor.execute(query)

    # Fetch and print results
    results = cursor.fetchall()
    #print("results", results)
    for row in results:
        print(f"First Name: {row[0]}, Last Name: {row[1]}")
except mysql.connector.Error as err:
    print(f"Error: {err}")

First Name: Michael, Last Name: Davis

## This query retrieves the first name and last name of employees who are assigned to events happening in Frisco.

In [49]:
# Define the query
query = """
SELECT firstName, lastName
FROM Employee
WHERE employeeID IN (
    SELECT employeeID
    FROM EmployeeEventAssignments
    WHERE eventID IN (
        SELECT eventID
        FROM Events
        WHERE locationID IN (
            SELECT locationID
            FROM Location
            WHERE city = 'frisco'
        )
    )
);
"""

try:
    # Execute the query
    cursor.execute(query)

    # Fetch and display results
    results = cursor.fetchall()
    for row in results:
        print(f"First Name: {row[0]}, Last Name: {row[1]}")
except mysql.connector.Error as err:
    print(f"Error: {err}")

First Name: Emily, Last Name: Clark
First Name: Jane, Last Name: Smith
First Name: Robert, Last Name: Johnson
First Name: Sarah, Last Name: Wilson
First Name: Benjamin, Last Name: Lee
First Name: James, Last Name: Anderson
First Name: Michael, Last Name: Davis